/*
笑介くんのクラス20人のテストの点数は, 理科が

65 80 67 35 58 60 72 75 68 92 36 50 2 58.5 46 42 78 62 84 70

英語が

44 87 100 63 52 60 58 73 55 86 29 56 89 23 65 84 64 27 86 84

でした. 

理科と英語のそれぞれについて, 平均点, 標準偏差, 合計点を求めよ. 
それぞれの人について, 理科と英語の偏差値を求めよ. 
さらに, 理科と英語のそれぞれについて点数の高い順に並べかえなさい.
*/
 

#include <stdio.h>

int main(){
  double sc[20] = {65,80,67,35,58,60,72,75,68,92,36,50,2,58.5,46,42,78,62,84,70};
  double en[20] = {44,87,100,63,52,60,58,73,55,86,29,56,89,23,65,84,64,27,86,84};

  double avesc,aveen;

  //get average
  for(int i;i<20;i++){
    avesc += sc[i];
    aveen += en[i];
  }
  avesc /= 20;
  aveen /= 20;
  
  return 0;
}
